# ╔══════════════════════════════════════════════════════╗
# ║          stildeeneca17-dots — Brewfile               ║
# ║   Run: brew bundle --file=Brewfile                   ║
# ╚══════════════════════════════════════════════════════╝

# ── Taps ──────────────────────────────────────────────────
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "fluxcd/tap"
tap "gentleman-programming/tap"

# ── Shell & Prompt ────────────────────────────────────────
brew "fish"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "starship"
brew "carapace"
brew "zoxide"
brew "atuin"

# ── Editor & Search ───────────────────────────────────────
brew "neovim"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "bat"
brew "eza"
brew "tree"
brew "jq"
brew "yq"

# ── Git & Version Control ─────────────────────────────────
brew "git"
brew "git-delta"
brew "gh"
brew "lazygit"

# ── Terminal multiplexer ──────────────────────────────────
brew "tmux"

# ── Languages & Runtimes ─────────────────────────────────
brew "node"
brew "python"
brew "pyenv"
brew "pyenv-virtualenv"
brew "deno"

# ── Python tooling ────────────────────────────────────────
brew "uv"
brew "poetry"

# ── Node tooling ──────────────────────────────────────────
brew "pnpm"

# ── DevOps & Cloud ────────────────────────────────────────
brew "kubernetes-cli"
brew "helm"
brew "k9s"
brew "stern"
brew "argocd"
brew "fluxcd/tap/flux"
brew "terraform"
brew "skopeo"
brew "lazydocker"
cask "docker"

# ── Azure ─────────────────────────────────────────────────
brew "azure-cli"

# ── AI & Productivity ─────────────────────────────────────
brew "gentleman-programming/tap/engram"
brew "gentleman-programming/tap/gentle-ai"
brew "gentleman-programming/tap/gga"

# ── Shell utilities ───────────────────────────────────────
brew "coreutils"
brew "curl"
brew "wget"
brew "htop"
brew "btop"
brew "fastfetch"
brew "shellcheck"
brew "direnv"
brew "tldr"
brew "mkcert"
brew "xh"

# ── Casks ─────────────────────────────────────────────────
cask "iterm2"
cask "ngrok"

# ── Fonts ─────────────────────────────────────────────────
cask "font-meslo-lg-nerd-font"
