# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Shell & Prompt
brew "fish"
brew "starship"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

# Editor & Search
brew "neovim"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "bat"
brew "eza"
brew "tree"
brew "jq"
brew "yq"

# Navigation
brew "zoxide"

# Git & Version Control
brew "git"
brew "gh"
brew "lazygit"

# Multiplexer
brew "tmux"

# Languages & Runtimes
brew "node"
brew "python"
brew "pyenv"
brew "pyenv-virtualenv"
brew "deno"

# Python tooling
brew "uv"

# DevOps & Cloud
brew "kubernetes-cli"
brew "helm"
brew "k9s"
brew "argocd"
brew "fluxcd/tap/flux"
brew "terraform"
brew "skopeo"
cask "docker"

# Azure
brew "azure-cli"

# AI & Productivity
brew "engram"
brew "opencode"

# Shell utilities
brew "coreutils"
brew "curl"
brew "wget"
brew "htop"
brew "shellcheck"

# Casks
cask "iterm2"

# Fonts
cask "font-meslo-lg-nerd-font"
